content/books/the_clean_code.md
+++
title = "The Clean Code"
author = ["Cyneox"]
date = 2021-02-01
tags = ["swe", "book"]
draft = false
+++

## The Clean Code {#the-clean-code}


### Description {#description}


## Notes {#notes}


### [Clean Code]({{< relref "../../topics/clean_code.md" >}}) {#clean-code--dot-dot-dot-dot-topics-clean-code-dot-md}


## Quotes {#quotes}


### The Clean Code - Note 1 {#the-clean-code-note-1}

> Code is anti-evil and clean code is perhaps divine


### The Clean Code - Note 2 {#the-clean-code-note-2}

> Remember that code is really the language in which we ultimately express the requirements. We may create languages that are closer to the requirements. We may create tools that help us parse and assemble those requirements into formal structures. But we will never eliminate necessary precision—so there will always be code


### The Clean Code - Note 3 {#the-clean-code-note-3}

> Every system is built from a domain-specific language designed by the programmers to describe that system. Functions are the verbs of that language, and classes are the nouns. This is not some throwback to the hideous old notion that the nouns and verbs in a require- ments document are the first guess of the classes and functions of a system. Rather, this is a much older truth. The art of programming is, and has always been, the art of language design.


### The Clean Code - Note 4 {#the-clean-code-note-4}

> We often forget that it is also best to postpone decisions until the last possible moment. This isn’t lazy or irresponsible; it lets us make informed choices with the best possible information. A premature decision is a decision made with suboptimal knowledge. We will have that much less customer feedback, mental reflection on the project, and experience with our implementation choices if we decide too soon


### The Clean Code - Note 5 {#the-clean-code-note-5}

> Instead of shirking from estimates or letting someone else do the planning (then complaining about it), the technical team actually self-organizes and makes real commitments


### The Clean Code - Note 6 {#the-clean-code-note-6}

> This philosophy is sometimes called merciless refactoring. I call it “the Boy Scout rule”: Always check in a module cleaner than when you checked it out. Always make some random act of kindness to the code whenever you see it.


### The Clean Code - Note 7 {#the-clean-code-note-7}

> Your career is your responsibility. It is not your employer’s responsibility to make sure you are marketable. It is not your employer’s responsibility to train you, or to send you to conferences, or to buy you books. These things are your responsibility. Woe to the software developer who entrusts his career to his employer.


### The Clean Code - Note 8 {#the-clean-code-note-8}

> How can you know your code works? That’s easy. Test it. Test it again. Test it up. Test it down. Test it seven ways to Sunday


### The Clean Code - Note 9 {#the-clean-code-note-9}

> If you let the tests rot, then your code will rot too. Keep your tests clean


### The Clean Code - Note 10 {#the-clean-code-note-10}

> Good software requires focus and presence of the mind.
